In [1]:
import numpy as np
import pandas as pd

In [2]:
user_data = {
                "Physics" : np.random.randint(1,100,5),
                "Chemistry" : np.random.randint(70,100,5),
                "Math" : np.random.randint(30,80,5)
            }

In [5]:
df = pd.DataFrame(user_data)
print(df)

   Physics  Chemistry  Math
0       73         85    37
1       46         93    36
2        5         80    62
3       71         89    48
4       34         75    77

In [7]:
df.head(n=3)

   Physics  Chemistry  Math
0       73         85    37
1       46         93    36
2        5         80    62

In [8]:
print(df.columns)

Index(['Physics', 'Chemistry', 'Math'], dtype='object')

In [9]:
#Create a CSV file from this data frame
df.to_csv('marks.csv')

In [10]:
#Read a CSV file
my_data = pd.read_csv('marks.csv')
my_data

   Unnamed: 0  Physics  Chemistry  Math
0           0       73         85    37
1           1       46         93    36
2           2        5         80    62
3           3       71         89    48
4           4       34         75    77

In [11]:
my_data = my_data.drop(columns = ['Unnamed: 0'])
my_data

   Physics  Chemistry  Math
0       73         85    37
1       46         93    36
2        5         80    62
3       71         89    48
4       34         75    77

In [12]:
my_data.describe()

         Physics  Chemistry       Math
count   5.000000   5.000000   5.000000
mean   45.800000  84.400000  52.000000
std    28.190424   7.127412  17.478558
min     5.000000  75.000000  36.000000
25%    34.000000  80.000000  37.000000
50%    46.000000  85.000000  48.000000
75%    71.000000  89.000000  62.000000
max    73.000000  93.000000  77.000000

In [14]:
my_data.tail(n=4)

   Physics  Chemistry  Math
1       46         93    36
2        5         80    62
3       71         89    48
4       34         75    77

In [15]:
#Access a particular row
df.iloc[3]

Physics      71
Chemistry    89
Math         48
Name: 3, dtype: int64

In [16]:
#Access a particular row and col
df.iloc[3,1]

89

In [17]:
df.iloc[3][1]

89

In [19]:
idx = df.columns.get_loc('Chemistry')
df.iloc[3][idx]

89

In [21]:
df.iloc[:3,idx]

0    85
1    93
2    80
Name: Chemistry, dtype: int64

In [23]:
my_data.sort_values(by = ['Physics'], ascending= False)

   Physics  Chemistry  Math
0       73         85    37
3       71         89    48
1       46         93    36
4       34         75    77
2        5         80    62

In [25]:
my_data.sort_values(by = ['Chemistry'], ascending= True)

   Physics  Chemistry  Math
4       34         75    77
2        5         80    62
0       73         85    37
3       71         89    48
1       46         93    36

In [ ]:
my_data.sort_values(by = ['Chemistry', 'Physics'], ascending= True)